<template lang="pug">
  .minota-screen
    slot
    //- bar-component
      slot(name="bar")
        i.material-icons announcement
        span &nbsp; Hello, world!
    //- fab-component
    //-   slot(name="fab")
    //-     i.material-icons edit
    //- main
      slot Hi
      //- p Я сказал дону Хуану, что его объяснения не удовлетворяют мои чувства, хотя интеллектуально я полностью согласен с ним.
      //- p — В этом слабая сторона слов, — сказал он ободряюще. — Они заставляют нас чувствовать себя осведомленными, но когда мы оборачиваемся, чтобы взглянуть на мир, они всегда предают нас, и мы опять смотрим на мир как обычно, без всякого просветления. Поэтому маг предпочитает действовать, а не говорить.
      //- p Затем дон Хуан рассказал мне, что одним из величайших достижений видящих времен Конкисты было открытие конструкции, которую он назвал «трехфазной прогрессией». Постигнув человеческую природу, видящие того времени смогли прийти к неоспоримому заключению: если видящий способен добиться своего, имея дело с мелким тираном, то он определенно сможет без вреда для себя встретиться с неизвестным и даже выстоять в столкновении с непознаваемым.
      //- p — Обычный человек, — продолжал дон Хуан, — расположил бы эти три утверждения в обратном порядке. Тогда получится, что видящий, способный остаться самим собой в столкновении с неизвестным, гарантированно может справляться с мелкими тиранами. Но в действительности это не так. Именно из-за такой ошибки погибли многие великолепные видящие древности. Однако теперь мы в этом разобрались получше. И знаем — ничто так не закаляет дух воина, как необходимость иметь дело с невыносимыми типами, обладающими реальной властью и силой. Это — совершенный вызов, и только в таких условиях воин обретает уравновешенность и ясность, без которых невозможно выдержать натиск непознаваемого.
      //- p Я сказал дону Хуану, что его объяснения не удовлетворяют мои чувства, хотя интеллектуально я полностью согласен с ним.
      //- p — В этом слабая сторона слов, — сказал он ободряюще. — Они заставляют нас чувствовать себя осведомленными, но когда мы оборачиваемся, чтобы взглянуть на мир, они всегда предают нас, и мы опять смотрим на мир как обычно, без всякого просветления. Поэтому маг предпочитает действовать, а не говорить.
      //- p Затем дон Хуан рассказал мне, что одним из величайших достижений видящих времен Конкисты было открытие конструкции, которую он назвал «трехфазной прогрессией». Постигнув человеческую природу, видящие того времени смогли прийти к неоспоримому заключению: если видящий способен добиться своего, имея дело с мелким тираном, то он определенно сможет без вреда для себя встретиться с неизвестным и даже выстоять в столкновении с непознаваемым.
      //- p — Обычный человек, — продолжал дон Хуан, — расположил бы эти три утверждения в обратном порядке. Тогда получится, что видящий, способный остаться самим собой в столкновении с неизвестным, гарантированно может справляться с мелкими тиранами. Но в действительности это не так. Именно из-за такой ошибки погибли многие великолепные видящие древности. Однако теперь мы в этом разобрались получше. И знаем — ничто так не закаляет дух воина, как необходимость иметь дело с невыносимыми типами, обладающими реальной властью и силой. Это — совершенный вызов, и только в таких условиях воин обретает уравновешенность и ясность, без которых невозможно выдержать натиск непознаваемого.
</template>

<script>
// import BarComponent from '@/components/layout/Bar'
// import FabComponent from '@/components/layout/Fab'

export default {
  name: 'Screen'

  // components: {
  //   BarComponent
  //   FabComponent
  // }
}
</script>

<style lang="stylus">
.minota-screen
  position relative
  flex-grow 1
  // & > main
  //   padding-left 16px
  //   padding-right 16px
  // box-shadow inset 0px 0px 0px 2px salmon
</style>